Repository: giellalt/corpus-sme
Catalog: prestable/tmx/smj/admin/depts/other_files/laereplan_engelsk.html.tmx
Source language: sme
Languages: smj

source: Udir.no - Eaŋgalsgiella oahppoplána
smj: Udir.no - OAHPPOPLÁDNA – IEŊŊILSGIELLA

source: Eaŋgalsgiella oahppoplána
smj: OAHPPOPLÁDNA – IEŊŊILSGIELLA

source: Máhttodepartemeanta mearridan láhkaásahussan 21.06.2013
smj: Mierreduvvam Máhttodepartementas láhkanjuolgadusá milta 21.06.2013

source: Ulbmil
smj: Ulmme

source: Eaŋgalsgiella lea máilmmigiella.
smj: Ieŋŋilsgiella le væráltgiella.

source: Deaivvadettiin eará riikkaid olbmuiguin, ruovttus dahje mátkkis, de dávjá dárbbaša eaŋgalsgiela.
smj: Gå ietjá almatjij ietjá rijkajs æjvvalip, sijdan jali mannulagán, le miján álu dárbbo ieŋŋilsgiellaj.

source: Eaŋgalsgiella geavahuvvo filmmain, girjjálašvuođas, lávlagiin, valáštallamis, gávppašeamis, buktagiin, diehtagis ja teknologiijas, ja dáid geavahansurggiid bokte leat olu eaŋgals sánit ja dadjanvuogit sajáiduvvan iežamet gielaide.
smj: Ieŋŋilsgiella aneduvvá filmajn, girjálasjvuodan, lávllagijn, valástallamijn, oassásijn, buktagijn, diehtagin, ja teknologijan ja daj adnosuorgij baktu le ållo bágo ieŋŋilsgielas boahtám mijá giellaj.

source: Go galgat ohcat dieđuid iežamet beroštumiid mielde dahje fágalaš oktavuođain, de ohcat dávjá eaŋgalsgillii.
smj: Gå galggap diedojt åhtsåt iehtjama berustimijs jali fágalasj aktijvuodan, de åhtsåp ieŋŋilsgiellaj.

source: Dasa lassin geavahuvvo eaŋgalsgiella eanet ahte eanet oahpu váldimis ja bargogiellan máŋgga fitnodagas.
smj: Ja ieŋŋilsgiella aneduvvá ienebut åhpadusán gå åvddåla ja aj nubbengiellan moatten vidnudagán.

source: Vai birgešeimmet máilmmis gos eaŋgalsgiella geavahuvvo riikkaidgaskasaš gulahallamis, de lea dárbbašlaš hálddašit geavahit eaŋgalsgiela ja diehtit mo giella geavahuvvo iešguđet oktavuođain.
smj: Jus galggap rijbbat væráldin gånnå ieŋŋilsgiella aneduvvá rijkajgasskasasj guládallamin, le dárbulasj adnet ieŋŋilsgielav ja diehtet gåktu giella aneduvvá duon dán aktijvuodan.

source: Dát mearkkaša ovdánahttit sátneriggodaga ja gálggaid geavahit giela jietnadatvuogádaga, riektačállima, grammatihka ja cealkka- ja teakstahuksema prinsihpaid, ja máhttit heivehit giela iešguđet fáttáide ja gulahallanoktavuođaide.
smj: Dát merkaj åvdedit báhkoboanndudagáv ja tjehpudagáv anátjit giela jiednasystemav, duollatjállemav, grammatihkav ja prinsihpajt gárgadis- ja tækstadahkamij, ja máhttet gielav hiebadit duon dán fáhkaoassáj ja guládallamdilláj.

source: Dát mearkkaša ahte máhttá earuhit njálmmálaš ja čálalaš giellageavaheami ja formálalaš ja eahpeformálalaš giellageavaheami.
smj: Dát sisadná sieradit njálmálasj ja tjálalasj giellaanov ja formálalasj ja iehpeformálalasj giellaanov.

source: Dasto mearkkaša dát váldit vuhtii kultuvrralaš ovttastallanvieruid ja buorremenolašvuođa go geavaha giela.
smj: Vijdábut merkaj dat vieledit kultuvralasj sæbrástallamvuogijt ja vættsásvuodakonvensjåvnåjt gå lip gielav adnemin.

source: Giellaoahpahallan dáhpáhuvvá deaivvadettiin máŋggalágan teavsttaiguin, main teaksta-doaba geavahuvvo viiddis mearkkašumis.
smj: Gielav oahppá gå adná tevstaj valjesvuodav, gånnå tækstamoallánahkko aneduvvá vijdes dádjadusájn.

source: Dása gullet njálmmálaš ja čálalaš ovdanbuktimat iešguđet oktavuođain, ja iešguđet njálmmálaš ja čálalaš teavsttat digitála mediain.
smj: Dási gulluji njálmálasj ja tjálalasj åvddånbuktema moatten kombinasjåvnån, ja moatte njálmálasj ja tjálalasj tevsta digitála mediájs.

source: Go mii leat dihtomielalaččat strategiijaid ektui maid geavahit oahppat giela, ja strategiijaid ektui mat veahkehit min áddet ja áddehallot, de šaddá máhtto- ja gálgaoččodeapmi álkibun ja jierpmáleabbon.
smj: Gå lip diedulattja strategijajda ma aneduvvi gå gielajt oahppap, ja strategijajt ma viehkedi mijáv dádjadittjat ja dádjaduvátjit, de åmastip máhtov ja tjehpudagáv álkkebut ja buorebut.

source: Lea maiddái dehálaš bidjat alcces oahppanmihttomeriid, gávnnahit mo dáid sáhttá olahit ja árvvoštallat iežas giellageavaheami.
smj: Ájnas le aj biedjat allasis ulmijlt gåktu gielav oahppat, ja gávnnat gåktu ulmijda jåksåt ja árvustallat ietjas giellaanov.

source: Eaŋgalsgiela oahppan ovddida máŋggagielatvuođa ja sáhttá šaddat dehálaš oassin min persovnnalaš ovdáneamis.
smj: Ieŋŋilsgielav oahppat doalvvu moattegielakvuohtaj mij máhttá sjaddat oassen ietjama persåvnålasj åvddånimes.

source: Giellaoahpahallama lassin galgá eaŋgalsgielfága veahkehit min áddet eallinvugiid ja kultuvrraid gos eaŋgalsgiella lea váldogiellan dahje almmolaš giellan.
smj: Duodden giella oahppamij galggá ieŋŋilsgiella vaddet dádjadusáv viessomvuohkáj ja kultuvrajda gånnå ieŋŋilsgiella le oajvvegiellan jali almulasj giellan.

source: Fága galgá veahkehit áddet mo eaŋgalsgiella geavahuvvo riikkaidgaskasaš gulahallangaskaoapmin.
smj: Fága baktu galggap dádjadit gåktu ieŋŋilsgiella aneduvvá rijkajgasskasasj guládallamgiellan.

source: Oahppat eaŋgalsgiel riikkaid birra ja dađistaga lassáneaddji eaŋgalsgielgeavaheami birra iešguđet riikkaidgaskasaš oktavuođain addá buori vuođu áddet máilmmi ja eaŋgalsgiela ovdáneami máilmmigiellan.
smj: Oahppat ieŋŋilsgielak rijkaj birra ja ieŋŋilsgiela ano birra moatten rijkajgasskasasj kontevstajn, vaddá midjij máhttelisvuodav dádjadit væráldav mij mijáv birástahttá ja ieŋŋilsgiela åvddånimev værálda giellan.

source: Eaŋgalsgiel girjjálašvuohta sáhttá addit lohkanmovtta eallinahkái ja čiekŋalat áddejumi earáin ja alddámet.
smj: Ieŋŋilsgielak girjálasj tevsta máhtti vaddet låhkåmávov ja tjiegŋalap dádjadusáv iehtjádijs ja ietjastimme.

source: Njálmmálaš, čálalaš ja digitála teavsttat, filmmat, musihkka ja eará kulturovdanbuktimat sáhttet maiddái movttiidahttit iežamet hervvohallama ja hutkáivuođa.
smj: Njalmálasj, tjálalasj ja digitála tevsta, musihkka ja ietjá kultuvrraåvddånbuktema máhttá arvusmahttet ietjas gisjugisvuodav ja sjuggelisvuodav.

source: Eaŋgalsgielfága lea sihke reaidofága ja oahppahábmenfága.
smj: Ieŋŋilsgiela fáhka le sihki adnofáhka ja dannelsesfag.

source: Dat galgá addit vejolašvuođa beassat searvat gulahallamii persovnnalaš, sosiála, girjjálašvuođa ja fágalaš fáttáid birra.
smj: Dajna vatteduvvá máhttelisvuodav oassálasstet guládallamij persåvnålasj, sosiála, girjálasj ja fágalasj suorgijda.

source: Fága galgá nannet oppalaš giellagealbbu guldaleami, hállama, lohkama ja čállima bokte, ja addit vejolašvuođa háhkat dieđuid ja fágamáhtu eaŋgalsgiela bokte.
smj: Fága baktu oadtju dábálasj giellamáhtudagáv gå gulldal, ságas, låhkå ja tjállá, ja oadtju máhttelisvuodav åmastittjat diedojt ja fáhkamáhtov ieŋŋilsgiela baktu.

source: Gulahallan- ja giellagálggaid ovdáneapmi ja kulturáddejupmi sáhttá ovddidit nannosat ovttasdoaibmama, áddejumi ja árvvusatnima olbmuid gaskii geain leat iešguđetlágan kulturduogážat.
smj: Åvddånibme kommunikatijva ja gielalasj tjehpudagáj ja kultuvralasj dádjadus máhttá åvdedit buorep aktan doajmmamav, dádjadusáv ja vieledusáv ulmutjij gaskan duot dát kultuvra duogátjis.

source: Ná šaddá giella- ja kulturgealbu oassin álbmotoahpus ja lea veahkkin nannemin demokráhtalaš beroštumi ja servodatmiellahttovuođa.
smj: Nav sjaddá giella- ja kultuvramáhtudahka oassen gájkkásasj dannelsen ja le siegen nannimin demokráhtalasj berustimev ja guojmmeviesátvuodav.

source: Fága lea juhkkojuvvon váldoosiide maidda leat hábmejuvvon gelbbolašvuođamihttomearit.
smj: Fága oajvveoase Fáhka le juogeduvvam oajvveåsijda, ja juohkka oasen li máhtudakmihto.

source: Váldooasit dievasmahttet guhtet guoimmiset, ja daid ferte geahččat oktilaččat.
smj: Oajvveoase li oase ållesvuodas ja dajn le aktijvuohta.

source: Fága lea oktasašfága joatkkaoahpahusa buot oahppoprográmmaide.
smj: Fáhka le aktisasjfáhka mij gullu divna joarkkaåhpadusáj åhpadusprográmmajda.

source: Oahpahus galgá danne leat eanemus lági mielde relevánta ohppiide ja heivehuvvot iešguđet oahppoprográmmaide.
smj: Danen galggá åhpadusáv iesjgeŋga åhpadusprográmmaj hiebadit váj sjaddá nav relevánnta gå vejulasj oahppijda.

source: Eaŋgalsgielas leat gelbbolašvuođamihttomearit maŋŋil vuođđoskuvlla 2., 4., 7. ja 10. ceahki ja maŋŋil Jo1:ža studerenráhkkanahtti oahppoprográmmaid / Jo2:ža fidnofágalaš oahppoprográmmaid.
smj: Ieŋŋilsfágan li vissa máhtudakmihto vuodoskåvlå 2., 4., 7. ja 10. jahkedáse maŋŋela ja joarkkaåhpadusá Jo1 oahppogárvediddje åhpadusprográmma / Jo2 viddnofágalasj åhpadusprográmma.

source: Váldoosiid bajilgovva:
smj: Oajvveåsij gåvvå: Jahkedásse

source: Váldooasit
smj: Oajvveoase

source: (fidnofágalaš oahppoprográmmat)
smj: (viddnofágalasj oahppo-prográmma)

source: Njálmmálaš gulahallan
smj: Njálmálasj guládallam

source: Čálalaš gulahallan
smj: Tjálalasj guládallam

source: Kultuvra, servodat ja girjjálašvuohta
smj: Kultuvrra, sebrudahka ja girjálasjvuohta

source: Giellaoahpahallan-váldooasis lea sáhka oahppat ođđa giela, oahppat eaŋgalsgiela ja oaidnit eaŋgalsgiela, eatnigiela ja eará giela oktavuođaid.
smj: Giellaåhpadusá oajvveoasen le gatjálvis oahppát ådå gielav, oahppat ieŋŋilsgielav, ja vuojnnet aktijvuodav ieŋŋilsgiela ja iednegiela ja ietjá gielaj gaskan.

source: Dasa gullá diehtu giela birra ja iežas giellaoahpahallama ádden.
smj: Dasi gulli máhtto giela hárráj ja dádjadus ietjas giellaåhpadusá hárráj.

source: Máhttit árvvoštallat iežas giellageavaheami ja iežas oahppandárbbuid ja válljet heivvolaš strategiijaid ja bargovugiid lea ávkkálaš go áigu oahppat ja geavahit eaŋgalsgiela.
smj: Máhttet ietjas giellaanov árvustallat ja ietjas åhpadusdárbojt ja válljit hiebalgis strategijajt ja barggovuogijt le dárbulasj gå le oahppamin ja adnemin ieŋŋilsgielav.

source: Njálmmálaš gulahallan-váldooasis lea sáhka áddet ja geavahit eaŋgalsgiela guldaleami, hállama ja ságastallama bokte, ja geavahit ulbmillaš gulahallanstrategiijaid.
smj: Njálmálasj guládallama oajvveoasen le gatjálvis dádjadit ja adnet ieŋŋilsgielav gå gulldala, håla ja ságastalá ja gå aná hiebalgis guládallamstrategijajt.

source: Váldooasis lea sáhka nannet sátneriggodaga ja geavahit idiomáhtalaš struktuvrraid ja grammatihkalaš vugiid hállamis ja ságastallamis.
smj: Oajvveoasen le gatjálvis åvdedit báhkoboanndudagáv ja adnet idiomáhtalasj struktuvrajt ja grammahtalasj skåvijt håladattijn ja ságastaládijn.

source: Dat máinnaša maiddái geavahit giela čielga jietnademiin ja intonašuvnnain.
smj: Dasi gullu aj ságastit tjielgga jiednadimijn ja intonasjåvnåjn.

source: Váldooassái gullá guldalit, áddet ja geavahit eaŋgalsgiela iešguđet njálmmálaš gulahallanoktavuođain.
smj: Oajvveoasen le gatjálvis gulldalit, dádjadit ja adnet ieŋŋilsgielav moatten guládallam aktijvuodan.

source: Leat buorremenolaš ja váldit vuhtii gustovaš servvoštallanvugiid lea dehálaš oassi dás.
smj: Ájnas le vuosedit berustimes ja vieledimev dábálasj sæbrástallamvuogijda.

source: Dás lea maiddái sáhka heivehit giela ulbmilii ja vuostáiváldái, earret eará earuhettiin formálalaš ja eahpeformálalaš njálmmálaš giela.
smj: Dánna le aj gatjálvis gielav hiebadit ulmmáj ja vuosstájválldijda, duola dagu sieradit formalalasj ja iehpeformalalasj njálmálasj giellaanov.

source: Iešguđet mediaid ja resurssaid geavaheapmi ja nannet gielalaš repertoára fágaid ja fáttáid rastá lea dehálaš dán váldooasis.
smj: Adnet duov dáv mediav ja ressursav, ja gielalasj boanndudagáv åvdedit fágaj ja fáhkaåsij gaskav le guovdátjin dán oajvveoasen.

source: Čálalaš gulahallan-váldooasis lea sáhka áddet ja geavahit eaŋgalsgiela logadettiin ja čáledettiin ja geavahettiin ulbmillaš lohkan- ja čállinstrategiijaid.
smj: Tjálalasj guládallama oajvveoasen le gatjálvis dádjadit ja adnet ieŋŋilsgielav gå le låhkåmin ja tjállemin ja adnet hiebalgis låhkåm- ja tjállemstretegijajt.

source: Váldooassái gullá lohkat iešguđetlágan teavsttaid eaŋgalsgillii ovddidan dihtii lohkanmovtta ja vásáhusa, ja áddet ja oččodit máhtu.
smj: Oajvveoasen le gatjálvis låhkåt duov dáv tevstav ieŋŋilsgiellaj arvusmahtátjit låhkåmávov ja muossádimijt, ja dádjadittjat ja åmastittjat máhtov.

source: Dát mearkkaša hivvodatlohkama mii nanne giellaáddejumi ja teakstagealbbu.
smj: Dási gullu ållo låhkåm mij åvdet gielladádjadusáv ja tækstamáhtudagáv.

source: Iešguđetlágan teavsttaid lohkan sáhttá leat vuođđun persovnnalaš ovdáneapmái, láddamii ja hutkáivuhtii ja movttiidahttá ieš hábmet teavstta.
smj: Låhkåt moattelágásj tevstajt le buorre persåvnålasj åvddånibmáj, láddamij ja kreativitehttaj ja båktå mielav tevstajt dahkat.

source: Váldooassái gullá maiddái čállit eaŋgalsgiel teavsttaid iešguđetlágan gulahallanoktavuođain ovddidan dihtii čállinmovtta ja vásáhusa, ja áddet ja háhkat máhtu.
smj: Oajvveoasen le aj gatjálvis tevstajt tjállet ieŋŋilsgiellaj duon dán guládallam aktijvuodan mij arvusmahttá tjállemávov ja muossádimijt, ja dádjadittjat ja åmastittjat máhtov.

source: Lea maiddái sáhka heivehit giela ulbmilii ja vuostáiváldái, earret eará earuhettiin formálalaš ja eahpeformálalaš čálalaš giela.
smj: Dánna le aj gatjálvis hiebadit gielav ulmmáj ja vuosstájválldijda, duola dagu sieradit formalalasj ja iehpeformalalasaj tjálalasj giellaanov.

source: Váldooassái gullá nannet sátneriggodaga, geavahit riektačállima, idiomáhtalaš struktuvrraid ja grammatihkalaš minstariid čállagis.
smj: Oajvveoasen le gatjálvis åvdedit báhkoboanndudagáv ja adnet duollatjállemav, idiomáhtalasj struktuvrajt ja grammahtalasj skåvijt tjáledijn.

source: Dat máinnaša maiddái hábmet teavsttaid struktuvrra ja oktavuođa.
smj: Dási gullu aj dahkat struktuvrajt ja aktijvuodajt tevstajn.

source: Kultuvra, servodat ja girjjálašvuohta-váldooasis lea sáhka kulturáddejumis viiddes mearkkašumis.
smj: Oajvveoasen Kultuvrra, sebrudahka ja girjálasjvuohta le gatjálvis kultuvrradádjadusás vijdes sisanujn.

source: Dat váldá vuolggasaji eaŋgalsgiel riikkain ja gokčá guovddáš fáttáid mat gusket servodateallimii, girjjálašvuhtii ja eará kulturovdanbuktimiidda.
smj: Álggo le ieŋŋilsgielak rijka, ja guosská guovdásj åsijda sebrudakiellemin, girjálasjvuodan ja ja ietjá kultuvrraåvddånbuktemijn.

source: Váldooasis lea sáhka háhkat máhtu eaŋgalsgiela birra máilmmigiellan mas leat olu geavahanguovllut.
smj: Oajvveoasen le aj gatjálvis máhtov åmastit ieŋŋelskgiela hárráj værálda giellan måttijn adnovejulasjvuodaj.

source: Váldooassái gullá bargat fágateavsttaiguin, girjjálašvuođa teavsttaiguin ja kultuvrralaš ovdanbuktimiiguin iešguđet median ja ságaškuššat daid.
smj: Oajvveoasen le gatjálvis árvvaladfat ja barggat fáhkatevstaj, girjálasj tevstaj ja kultuvralasj åvddånbuktemij duot dát medias.

source: Dát lea dehálaš máhtu, áddejumi ja árvvusatnima ovdánahttimii eará eallinvugiide ja kultuvrraide.
smj: Dát le ájnas máhtov ja dádjadusáv åvddånahtátjit ja aj vieledusáv iehtjádij viessomvuogijs ja kultuvrajs.

source: Diibmolohku
smj: Tijmmalåhko

source: Tiibmalohku lea almmuhuvvon 60-minuhta ovttadahkan:
smj: Akta tijmma le 60-minuhta.

source: 1.–4. jahkeceahkit: 138 tiimma
smj: 1.-4. jahkedásen: 138 tijma

source: 5.–7. jahkeceahkit: 228 tiimma
smj: 5.-7. Jahkedásen: 228 tijma

source: 8.–10. jahkeceahkit: 222 tiimma
smj: 8.-10 jahkedásen: 222 tijma

source: Vuođđogálggat
smj: Vuodotjehpudagá

source: Vuođđogálggat leat integrerejuvvon gelbbolašvuođamihttomeriide gos dat leat mielde ovdánahttimin fágagelbbolašvuođa ja leat maid oassin das.
smj: Vuodotjehpudagá li avtajduhtedum máhtudakmihtojda gånnå åvdedi fáhkamáhtudagáv ja li oassen fáhkamáhtudagás.

source: Eaŋgalsgielfágas áddejuvvojit vuođđogálggat ná:
smj: Ieŋŋiskgielan dádjaduvvi vuodotjehpudagá náv:

source: Njálmmálaš gálggat eaŋgalsgielfágas leat máhttit guldalit, hállat ja ovttasdoaibmat eaŋgalsgiela geavahusa bokte.
smj: Njálmálasj tjehpudagá ieŋŋilsgielan li gulldalit, hållat ja aktan doajmmat ieŋŋilsgiela baktu.

source: Dát mearkkaša árvvoštallat ja heivehit ovdanbuktinvugiid ulbmila, vuostáiváldi ja dilálašvuođa hárrái. Dát mearkkaša dasto oahppat sosiála vieruid ja servvoštallanvugiid eaŋgalsgiel riikkain ja riikkaidgaskasaš oktavuođain.
smj: Dát merkaj árvustallat ja hiebadit åvddånbuktemijt ulmmáj, vuosstájválldijda ja dilláj, ja aj oahppat sosiála konvensjåvnåj ja sæbrástallamvuogij birra ieŋŋelskgielak rijkajn ja rijkajgasskasasj kontevstajn.

source: Njálmmálaš gálggaid ovdánahttin eaŋgalsgielas mearkkaša geavahit njálmmálaš giela ságastallamiin ja eará njálmmálaš gulahallamis dađistaga deaivileappot ja eanet nyanserejuvvon vugiin.
smj: Njálmálasj tjehpudagá åvddånibme ieŋŋilsgielan merkaj adnet njálmálasj gielav dárkkelappot ja moatte láhkáj ságastaládijn ja ietjá njálmálasj guládallamin.

source: Dasto mearkkaša dát guldalit, áddet ja ságaškuššat iešguđet fáttáid ja čuolmmaid háhkan dihtii fágagealbbu.
smj: Vijdábut merkaj gulldalit, dádjadit ja ságastallat duov dáv ássjev ja tjuolmaj birra ja daj baktu åmastit fáhkamáhtov.

source: Dát mearkkaša maiddái áddet njálmmálaš eaŋgalsgiela variánttaid iešguđet osiin máilmmis.
smj: Dát merkaj aj dádjadit variántajt njálmálasj ieŋŋilsgielas duot dát guovlos væráldin.

source: Máhttit čállit eaŋgalsgiela lea máhttit ovdanbuktit ideaid ja oaiviliid áddehahtti láhkai ja ulbmillaččat eaŋgalsgiela čállingiela geavahemiin.
smj: Buktet tjállet ieŋŋiskgiela hárráj le máhttet buktet åvddån ájádusájt ja vuojnojt tjálalattjat dádjadahtte ja hiebalgis láhkáj.

source: Dát mearkkaša plánet, hábmet ja gieđahallat teavsttaid mat kommuniserejit, ja main lea buorre struktuvra ja oktavuohta.
smj: Dát merkaj plánit, hábbmit ja ásadit tevstajt majna guládallá, ja gånnå le buorre struktuvrra ja aktijvuohta.

source: Dasa lassin lea čállin giellaoahpahallama reaidun.
smj: Duodden le tjállem ájnas ja oassen giellaoahppamis.

source: Čállingálggaid ovdánahttin eaŋgalsgielas mearkkaša oahppat riektačállima ja ovdánahttit ain nannosat eaŋgalsgiel sátneriggodaga ja gielalaš struktuvrraid.
smj: Åvddånit tjállemtjehpudagá hárráj ieŋŋilsgielan merkaj oahppat duollatjállemav, ja báhkoboanndudagáv ja gielalasj struktuvrajt åvddånahttet.

source: Dasto mearkkaša dát ovdánahttit buotbeallásaš gealbbu čállit iešguđetlágan oppalaš, girjjálašvuođa ja fágalaš teavsttaid eaŋgalsgillii, mat leat heivehuvvon ulbmilii ja vuostáiváldái, eahpeformálalaš ja formálalaš giela geavahemiin.
smj: Vijdábut åvddånahttet máhtudagáv tjálátjit duov dáv dábálasj, girjálasj ja fágalasj tevstajt ieŋŋelsk giellaj iehpeformálalasj ja formálalasj giellaanujn, hiebadum ulmmáj ja vuosstáválldijda.

source: Máhttit lohkat eaŋgalsgiela lea máhttit duddjot áddejumi iešguđetlágan teavsttaid vuođul.
smj: Buktet låhkåt ieŋŋliskgielan le oadtjot dádjadusáv duot dát tevstas.

source: Dat mearkkaša lohkat eaŋgalsgiel teavsttaid áddet, jurddašit ja háhkat áddejumi ja máhtu kultuvrraid ja fágasurggiid rastá.
smj: Dát merkaj ieŋŋiskgielak tevstajt låhkåt vaj dádjat, reflekteri ja åmas dádjadusáv ja máhtov kultuvrajs ja fáhkasuorgijs.

source: Dasto mearkkaša dát ráhkkanit lohkat eaŋgalsgiel teavsttaid iešguđet ulbmiliidda ja iešguđet guhkkodagas ja kompleksitehtas, ja lohkat ja gieđahallat daid.
smj: Dát merkaj aj gárvedit, dahkat ja hárjjánit låhkåt ieŋŋilsgielak tevstajt duon dán sivá diehti, ja duot dát guhkkudagás ja gássjelisvuodas.

source: Lohkangálggaid ovdánahttin eaŋgalsgielas lea geavahit lohkanstrategiijaid mat leat heivehuvvon dađistaga váttásmuvvi teavsttaid lohkama ulbmilii.
smj: Åvddånit låhkåmtjehpudagá hárráj ieŋŋilsgielan le adnuj válldet låhkåmstrategijajt hiebadum låhkåma ulmmáj maŋenagi gássjelap tevstaj.

source: Dasto mearkkaša dát lohkat eaŋgalsgiel teavsttaid njuovžilit ja áddejumiin, ja suokkardit, ságaškuššat, oahppat iešguđetlágan dieđuid ja smiehttat daid birra.
smj: Vijdábut le gatjálvis låhkåt ieŋŋliskgielak tevstajt duolla ja dádjadusájn, ja guoradallat, árvvaladdat, oahppat ja ájádallat duov dáv diedov.

source: Máhttit rehkenastit eaŋgalsgielas lea máhttit relevánta matematihkalaš eaŋgalsgiel doahpagiid iešguđet oktavuođain.
smj: Buktet rieknit ieŋŋliskgielan le oadtjot adnet guoskavasj matematihkalasj buojkuldagájt ieŋŋliskgiellaj duon dán dilen.

source: Dát mearkkaša dovdat mihttoovttadagaid mat geavahuvvojit eaŋgalsgiel riikkain, ja áddet ja gulahallat loguiguin, gráfalaš ovdanbuktimiiguin, tabeallaiguin ja statistihkaiguin eaŋgalsgillii.
smj: Dát merkaj dåbddåt mihttimavtadagájt ma ieŋŋliskgielak rijkajn aneduvvi, ja dádjadit ja guládallat tállaj, grafalasj åvddånbuktemij, tabellaj ja statestihkaj ieŋŋliskgiellaj.

source: Rehkenastingálggaid ovdánahttin eaŋgalsgielas mearkkaša geavahit loguid ja rehkenastima ovddidettiin matematihkalaš eaŋgalsgiel doahpagiid repertoára mii guoská árgabeaivái, ja oppalaš ja fágalaš fáttáid.
smj: Rieknimtjehpudagá åvddånibme ieŋŋliskgiela hárráj merkaj adnet tállajt ja rieknimav gå åvddånahttá repertoarav matematihka termajs ieŋŋliskgiellaj ma li viettjadum bæjválasj iellemis, ja dábálasj ja fágalasj ássjijs.

source: Digitála gálggat eaŋgalsgielas lea máhttit geavahit iešguđetlágan digitála reaidduid, mediaid ja resurssaid nannet giellaoahpahallama, gulahallat eaŋgalsgillii ja háhkat relevánta máhtu eaŋgalsgielfágas.
smj: Digitála tjehpudagá ieŋŋilsgielan le máhttet adnet valjep oasev digitála vædtsagijs, miediajs ja ressursajs nannitjit giellaoahppamav, guládalátjit ieŋŋilsgiellaj ja åmastittjat guoskavasj máhtov ieŋŋilsfágan.

source: Digitála resurssaid geavaheapmi addá vejolašvuođa vásihit eaŋgalsgiel teavsttaid autenttalaš oktavuođain, nappo lunddolaš, ii-heivehuvvon oktavuođain.
smj: Gå adná digitála ressursajt de vaddá dat máhttelisvuodajt åtsådalátjit ieŋŋilsgielak tevstajt autentalasj dilijn, dat sihtá javllat luondulasj, ij-hiebadum dilijn.

source: Digitála gálggaid ovdánahttin mearkkaša viežžat ja gieđahallat dieđuid hábmen dihtii iešguđetlágan teavsttaid.
smj: Åvddånahttet digitála tjehpudagájt merkaj viedtjat ja giehtadallat diedojt majs ådå tevstajt vas dahká.

source: Digitála teavsttaid hápmegáibádusat mearkkašit ahte efeavttat, govat, tabeallat, bajilčállagat ja čuoggát leat biddjon oktii deattuhan ja gaskkustan dihtii dieđu.
smj: Digitála hábmegájbbádus tevstajn merkaj jut effekta, gåvå, tabella, bajelttjállaga ja tsiehke li tjoahkkáj biejaduvvam nannitjit ja gaskostittjat diedojt.

source: Dát mearkkaša dasto geavahit digitála gálduid čálalaš ja njálmmálaš teavsttain, ja ahte olbmos leat kritihkalaš ja iešheanalaš guottut gáldogeavaheapmái.
smj: Dánne le aj gatjálvis adnet digitála gáldojt tjálalasj ja njálmálasj tevstajn, ja adnet lájttalis ja iesjrádálasj guottov gálldoadnuj.

source: Digitála gálggat mearkkaša ovdánahttit máhtu dahkkivuoigatvuođa ja personsuodjalusa birra dárkkisdahtti gáldočujuhusaid bokte.
smj: Digitála tjehpudagá merkaj åvddånahttet máhtov ja persåvnnåsuodjalimev gálldovuosedimij baktu majt maŋenagi dåhkki guoradallat.

source: Gelbbolašvuođamihttomearit 2. jahkeceahki maŋŋil
smj: Máhtudakmihto 2. jahkedáse maŋŋela Giellaåhpadus

source: Oahpahusa mihttomearri lea ahte oahppi galgá máhttit
smj: Åhpadusá mihttomierre le oahppe galggá máhttet

source: buktit ovdamearkkaid dilálašvuođain goas sáhttá leat ávkkálaš máhttit eaŋgalsgiela
smj: buktet buojkulvisájt muhtem dilijda gånne le ávkálasj ieŋŋiskgielav máhttet

source: gávdnat sániid ja dadjanvugiid mat leat oktasaččat eaŋgalsgielas ja iežas eatnigielas
smj: gávnnat bágojt ja moallánahkkojt ma li aktisattja ieŋŋilsgielan ja ietjat iednegielan

source: geavahit digitála resurssaid giellavásiheapmái
smj: adnet digitala ressursajt gå le gielav oahppamin

source: guldalit ja geavahit eaŋgals giellajienaid praktihkalaš-estehtalaš ovdanbuktinvugiid bokte
smj: gulldalit ja adnet ieŋŋilsgiela giellajienajt praktisk-estetalasj åvddånbuktemvuogij baktu

source: guldalit ja áddet álkes gohččumiid eaŋgalsgillii
smj: gulldalit ja dádjadit álkkes bagádallamijt ieŋŋilsgiellaj

source: guldalit ja áddet sániid ja dadjanvugiid eaŋgalsgiel riimmain, hoahkamiin, lávlagiin, máidnasiin ja muitalusain
smj: gulldalit ja dádjadit bágojt ja moallánahkkojt ieŋŋilsgielak rijmajn, gáritjijn, lávllagijn ja subttsasijn
